tutorials/streetCanyonAirBrick/constant/air/radiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      radiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

radiationModel  none;

absorptionEmissionModel constantAbsorptionEmission;

constantAbsorptionEmissionCoeffs
{
	absorptivity absorptivity [ 0 -1 0 0 0 0 0 ] 0.5;
	emissivity emissivity [ 0 -1 0 0 0 0 0 ] 0.5;
	E E [ 1 -1 -3 0 0 0 0 ] 0;
}

scatterModel constantScatter;

constantScatterCoeffs
{ 
sigma sigma [ 0 -1 0 0 0 0 0 ] 0;
C C [ 0 0 0 0 0 0 0 ] 0;
}

// ************************************************************************* //
