tutorials/streetCanyonAirBrick/0/air/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    top
    {
        type            symmetryPlane;
    }
    inlet
    {
        type            fixedValue;
		value			uniform (3 0 0);
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }
    air_to_brick      
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }	
    ground      
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    walls      
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }	
    sides
    {
        type            empty;
    }
}

// ************************************************************************* //
