tutorials/streetCanyonAirBrick/0/air/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    top
    {
        type            symmetryPlane;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 300;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 300;
        value           uniform 300;
    }
    air_to_brick
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        value           uniform 300;
        neighbourFieldName T;
        kappa           fluidThermo;
        kappaName       none;
    }	
    ground      
    {
        type            fixedValue;
        value           uniform 300;
    }
    walls      
    {
        type            fixedValue;
        value           uniform 300;
    }	
    sides
    {
        type            empty;
    }
}

// ************************************************************************* //
