tutorials/streetCanyonAirBrick/0/air/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.304831593;

boundaryField
{
    top
    {
        type            symmetryPlane;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 0.1;
    }

    outlet
    {
        type            zeroGradient;
    }
    air_to_brick
    {
        type            compressible::kqRWallFunction;
        value           uniform 0.1;
    }	
    ground
    {
        type            compressible::kqRWallFunction;
        value           uniform 0.1;
    }
    walls
    {
        type            compressible::kqRWallFunction;
        value           uniform 0.1;
    }
    sides
    {
        type            empty;
    }
}


// ************************************************************************* //
