tutorials/streetCanyonAirBrick/0/brick/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    top
    {
        type            zeroGradient;
    }
    bottom
    {
        type            zeroGradient;
    }
    interior
    {
        type            fixedValue;
		value			uniform 350;
    }
    brick_to_air      
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        value           uniform 300;
        neighbourFieldName T;
        kappa           solidThermo;
        kappaName       none;
    }
    sides
    {
        type            empty;
    }
}

// ************************************************************************* //
